app/views/quizzes/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = $1  [["quiz_id", 3]]
---
    <ol>
    <% @quiz.questions.each do |question| %>

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 3]]
---
        <ul>
        <% question.answers.each do |answer| %>