app/views/resources/index.html.erb

          <td><%= res.name  %></td>
          <td><%= res.images.count  %></td>
          <td><%= res.documents.count %></td>
          <td><%= res.links.count  %></td>
---
SELECT "images".* FROM "images" WHERE "images"."resource_id" = $1  [["resource_id", 39]]
SELECT "documents".* FROM "documents" WHERE "documents"."resource_id" = $1  [["resource_id", 39]]
SELECT "links".* FROM "links" WHERE "links"."resource_id" = $1  [["resource_id", 39]]