app/views/resources/show.html.erb

SELECT "images".* FROM "images" WHERE "images"."resource_id" = $1  [["resource_id", 40]]
SELECT COUNT(*) FROM "images" WHERE "images"."resource_id" = $1  [["resource_id", 1]]
---
    <h5>No. of Images:</h5>
      <% if @resource.images.count > 0 %>

SELECT COUNT(*) FROM "documents" WHERE "documents"."resource_id" = $1  [["resource_id", 1]]
---
    <h5>No. of Documents:</h5>
      <% if @resource.documents.count > 0 %>

SELECT COUNT(*) FROM "links" WHERE "links"."resource_id" = $1  [["resource_id", 1]]
---
    <h5>No. of Videos:</h5>
        <% if @resource.links.count > 0 %>