app/controllers/challenges_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def index
    @project = Project.find(params[:project_id])

SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    @challenge = Challenge.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "challenges" ("name", "description", "duration", "points", "category", "level", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @project = Project.find(params[:project_id])
    @challenge = @project.challenges.build(challenge_params)

    respond_to do |format|
      if @challenge.save