app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" INNER JOIN "company_users" ON "companies"."id" = "company_users"."company_id" WHERE "company_users"."user_id" = $1  [["user_id", 2]]
---
  def index
    @companies = current_user.companies.all

INSERT INTO "companies" ("name", "description", "location", "contact_no", "email", "ceo", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "company_users" ("user_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["company_id", 13], ["created_at", "2018-01-10 12:59:35.940161"], ["updated_at", "2018-01-10 12:59:35.940161"]]
---
  def create

    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
        format.html { redirect_to company_departments_path(@company.id), notice: 'Company was successfully created.' }
        format.json { render :show, status: :created, location: @company }
        @company.company_users.create(user_id: current_user.id);