app/controllers/departments_controller.rb

  def index
    @current_company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def new
    @company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @company = Company.find(params[:company_id])
    @department = @company.departments.build(department_params)
    respond_to do |format|
      if @department.save
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "departments" ("name", "description", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Math"], ["description", "cys"], ["company_id", 2], ["created_at", "2017-12-18 06:11:19.024274"], ["updated_at", "2017-12-18 06:11:19.024274"]]