app/controllers/projects_controller.rb

  def index
    @department = Department.find(params[:department_id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def new
    @department = Department.find(params[:department_id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]

  def create
    @department = Department.find(params[:department_id])
    @project = @department.projects.build(project_params)

    respond_to do |format|
      if @project.save
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
INSERT INTO "projects" ("name", "description", "category", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Smart Wallet"], ["description", "sjak"], ["category", "A"], ["department_id", 40], ["created_at", "2018-01-12 17:44:35.626989"], ["updated_at", "2018-01-12 17:44:35.626989"]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "end_date" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["end_date", "2017-12-06 20:27:54"], ["updated_at", "2017-12-06 00:01:50.627393"], ["id", 5]]