app/controllers/quizzes_controller.rb

  def index
    @challenge = Challenge.find(params[:challenge_id])
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def new
    @challenge = Challenge.find(params[:challenge_id])
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def create
    @challenge = Challenge.find(params[:challenge_id])
    @quiz = @challenge.quizzes.build(quiz_params)

    respond_to do |format|
      if @quiz.save
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "quizzes" ("name", "time_allowed", "no_of_questions", "pass_score", "created_at", "updated_at", "challenge_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Web"], ["time_allowed", "10"], ["no_of_questions", 1], ["pass_score", 5], ["created_at", "2018-01-13 10:41:17.819299"], ["updated_at", "2018-01-13 10:41:17.819299"], ["challenge_id", 8]]