app/controllers/resources_controller.rb

  def index
    @challenge = Challenge.find(params[:challenge_id])
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def new
    @challenge = Challenge.find(params[:challenge_id])
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def create
    @challenge = Challenge.find(params[:challenge_id])
    @resource = @challenge.resources.build(resource_params)
    respond_to do |format|
      if @resource.save
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "resources" ("created_at", "updated_at", "challenge_id", "link") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2018-01-12 07:55:04.643973"], ["updated_at", "2018-01-12 07:55:04.643973"], ["challenge_id", 5], ["link", "https://www.youtube.com/watch?v=NE8cCljW2w0"]]